app/views/lists/list.html.erb

	<% @lists.each do |list| %>
	<li id="list_<%= list.id %>"><a href="#" onclick="selectList(<%= list.id %>);"><span class="badge pull-right"><%= list.items.size %></span><%= list.list_name %></a></li>
---
SELECT COUNT(*) FROM `items` WHERE `items`.`list_id` = 1