app/controllers/items_controller.rb

INSERT INTO `items` (`created_at`, `item_name`, `list_id`, `updated_at`) VALUES ('2013-12-19 22:48:15', 'Kristofor', 1, '2013-12-19 22:48:15')
---
  def create
    #Instantiate object
    item = Item.new(item_params)
    #Save Object
    if item.save

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
---
  def show
    if Item.where(params[:id]).blank?

SELECT `items`.* FROM `items` WHERE `items`.`id` = 1 LIMIT 1
UPDATE `items` SET `quantity` = 10, `approximate_cost` = 2.0, `source` = 'My', `source_url` = 'http://apple.com', `reason_for_item` = 'Something', `updated_at` = '2013-12-20 01:28:03' WHERE `items`.`id` = 3
---
  def update
    if Item.where(:id => params[:id]).blank?
      render :json =>{:result => 'error', :message => 'The requested item does not exist.'}, :status => 404
    else
      selected_item = Item.find(params[:id])
      selected_item.update_attributes(item_params)

SELECT `items`.* FROM `items` WHERE `items`.`id` = 6 LIMIT 1
DELETE FROM `items` WHERE `items`.`id` = 6
---
  def destroy
    if Item.where(:id => params[:id]).blank?
      render :json => {:status => "error", :message => 'No such Item was found.'}
    else
      item = Item.find(params[:id])
      item.destroy()