app/controllers/lists_controller.rb

INSERT INTO `lists` (`created_at`, `list_name`, `updated_at`) VALUES ('2013-12-19 19:59:24', 'test', '2013-12-19 19:59:24')
---
  def create
    #Instantiate object
    list = List.new(list_params)
    #Save Object
    if list.save

SELECT `lists`.* FROM `lists` WHERE `lists`.`active` = 1 ORDER BY lists.created_at ASC
SELECT COUNT(*) FROM `lists` WHERE `lists`.`active` = 1
---
  def list
    lists = List.where(:active=>true).order('lists.created_at ASC')
    render :json => {:result => 'success', :lists => lists.as_json(include: {items: {only: [:id, :item_name]}},
      only: [:id,:list_name] ), :listCount => lists.size }

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 5 LIMIT 1
---
  def show
    if List.where(:id => params[:id]).blank?

SELECT `lists`.* FROM `lists` WHERE `lists`.`id` = 20 LIMIT 1
DELETE FROM `lists` WHERE `lists`.`id` = 20
---
  def destroy
    if List.where(:id => params[:id]).blank?
      render :json => {:status => "error", :message => 'No such list was found.'}
    else
      list = List.find(params[:id])
      list.destroy